PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p16lf1776.inc
RG1ISET0         EQU  H'0000'
RG1ISET1         EQU  H'0001'
RG1ISET2         EQU  H'0002'
RG1ISET3         EQU  H'0003'
RG1ISET4         EQU  H'0004'


;----- PRG2RTSS Bits -----------------------------------------------------
RTSS0            EQU  H'0000'
RTSS1            EQU  H'0001'
RTSS2            EQU  H'0002'
RTSS3            EQU  H'0003'

RG2RTSS0         EQU  H'0000'
RG2RTSS1         EQU  H'0001'
RG2RTSS2         EQU  H'0002'
RG2RTSS3         EQU  H'0003'


;----- PRG2FTSS Bits -----------------------------------------------------
FTSS0            EQU  H'0000'
FTSS1            EQU  H'0001'
FTSS2            EQU  H'0002'
FTSS3            EQU  H'0003'

RG2FTSS0         EQU  H'0000'
RG2FTSS1         EQU  H'0001'
RG2FTSS2         EQU  H'0002'
RG2FTSS3         EQU  H'0003'


;----- PRG2INS Bits -----------------------------------------------------
INS0             EQU  H'0000'
INS1             EQU  H'0001'
INS2             EQU  H'0002'
INS3             EQU  H'0003'

RG2INS0          EQU  H'0000'
RG2INS1          EQU  H'0001'
RG2INS2          EQU  H'0002'
RG2INS3          EQU  H'0003'


;----- PRG2CON0 Bits -----------------------------------------------------
GO_PRG2CON0      EQU  H'0000'
OS               EQU  H'0001'
REDG             EQU  H'0004'
FEDG             EQU  H'0005'
EN               EQU  H'0007'

MODE0_PRG2CON0   EQU  H'0002'
MODE1_PRG2CON0   EQU  H'0003'

RG2GO            EQU  H'0000'
RG2OS            EQU  H'0001'
RG2REDG          EQU  H'0004'
RG2FEDG          EQU  H'0005'
RG2EN            EQU  H'0007'

RG2MODE0         EQU  H'0002'
RG2MODE1         EQU  H'0003'


;----- PRG2CON1 Bits -----------------------------------------------------
RPOL             EQU  H'0000'
FPOL             EQU  H'0001'
RDY              EQU  H'0002'

RG2RPOL          EQU  H'0000'
RG2FPOL          EQU  H'0001'
RG2RDY           EQU  H'0002'


;----- PRG2CON2 Bits -----------------------------------------------------
ISET0            EQU  H'0000'
ISET1            EQU  H'0001'
ISET2            EQU  H'0002'
ISET3            EQU  H'0003'
ISET4            EQU  H'0004'


RG2ISET0         EQU  H'0000'
RG2ISET1         EQU  H'0001'
RG2ISET2         EQU  H'0002'
RG2ISET3         EQU  H'0003'
RG2ISET4         EQU  H'0004'


;----- PRG3RTSS Bits -----------------------------------------------------
RTSS0            EQU  H'0000'
RTSS1            EQU  H'0001'
RTSS2            EQU  H'0002'
RTSS3            EQU  H'0003'

RG3RTSS0         EQU  H'0000'
RG3RTSS1         EQU  H'0001'
RG3RTSS2         EQU  H'0002'
RG3RTSS3         EQU  H'0003'


;----- PRG3FTSS Bits -----------------------------------------------------
FTSS0            EQU  H'0000'
FTSS1            EQU  H'0001'
FTSS2            EQU  H'0002'
FTSS3            EQU  H'0003'

RG3FTSS0         EQU  H'0000'
RG3FTSS1         EQU  H'0001'
RG3FTSS2         EQU  H'0002'
RG3FTSS3         EQU  H'0003'


;----- PRG3INS Bits -----------------------------------------------------
INS0             EQU  H'0000'
INS1             EQU  H'0001'
INS2             EQU  H'0002'
INS3             EQU  H'0003'

RG3INS0          EQU  H'0000'
RG3INS1          EQU  H'0001'
RG3INS2          EQU  H'0002'
RG3INS3          EQU  H'0003'


;----- PRG3CON0 Bits -----------------------------------------------------
GO_PRG3CON0      EQU  H'0000'
OS               EQU  H'0001'
REDG             EQU  H'0004'
FEDG             EQU  H'0005'
EN               EQU  H'0007'

MODE0_PRG3CON0   EQU  H'0002'
MODE1_PRG3CON0   EQU  H'0003'

RG3GO            EQU  H'0000'
RG3OS            EQU  H'0001'
RG3REDG          EQU  H'0004'
RG3FEDG          EQU  H'0005'
RG3EN            EQU  H'0007'

RG3MODE0         EQU  H'0002'
RG3MODE1         EQU  H'0003'


;----- PRG3CON1 Bits -----------------------------------------------------
RPOL             EQU  H'0000'
FPOL             EQU  H'0001'
RDY              EQU  H'0002'

RG3RPOL          EQU  H'0000'
RG3FPOL          EQU  H'0001'
RG3RDY           EQU  H'0002'


;----- PRG3CON2 Bits -----------------------------------------------------
ISET0            EQU  H'0000'
ISET1            EQU  H'0001'
ISET2            EQU  H'0002'
ISET3            EQU  H'0003'
ISET4            EQU  H'0004'


RG3ISET0         EQU  H'0000'
RG3ISET1         EQU  H'0001'
RG3ISET2         EQU  H'0002'
RG3ISET3         EQU  H'0003'
RG3ISET4         EQU  H'0004'


;----- COG3PHR Bits -----------------------------------------------------
PHR0             EQU  H'0000'
PHR1             EQU  H'0001'
PHR2             EQU  H'0002'
PHR3             EQU  H'0003'
PHR4             EQU  H'0004'
PHR5             EQU  H'0005'

G3PHR0           EQU  H'0000'
G3PHR1           EQU  H'0001'
G3PHR2           EQU  H'0002'
G3PHR3           EQU  H'0003'
G3PHR4           EQU  H'0004'
G3PHR5           EQU  H'0005'


;----- COG3PHF Bits -----------------------------------------------------
PHF0             EQU  H'0000'
PHF1             EQU  H'0001'
PHF2             EQU  H'0002'
PHF3             EQU  H'0003'
PHF4             EQU  H'0004'
PHF5             EQU  H'0005'

G3PHF0           EQU  H'0000'
G3PHF1           EQU  H'0001'
G3PHF2           EQU  H'0002'
G3PHF3           EQU  H'0003'
G3PHF4           EQU  H'0004'
G3PHF5           EQU  H'0005'


;----- COG3BLKR Bits -----------------------------------------------------
BLKR0            EQU  H'0000'
BLKR1            EQU  H'0001'
BLKR2            EQU  H'0002'
BLKR3            EQU  H'0003'
BLKR4            EQU  H'0004'
BLKR5            EQU  H'0005'

G3BLKR0          EQU  H'0000'
G3BLKR1          EQU  H'0001'
G3BLKR2          EQU  H'0002'
G3BLKR3          EQU  H'0003'
G3BLKR4          EQU  H'0004'
G3BLKR5          EQU  H'0005'


;----- COG3BLKF Bits -----------------------------------------------------
BLKF0            EQU  H'0000'
BLKF1            EQU  H'0001'
BLKF2            EQU  H'0002'
BLKF3            EQU  H'0003'
BLKF4            EQU  H'0004'
BLKF5            EQU  H'0005'

G3BLKF0          EQU  H'0000'
G3BLKF1          EQU  H'0001'
G3BLKF2          EQU  H'0002'
G3BLKF3          EQU  H'0003'
G3BLKF4          EQU  H'0004'
G3BLKF5          EQU  H'0005'


;----- COG3DBR Bits -----------------------------------------------------
DBR0             EQU  H'0000'
DBR1             EQU  H'0001'
DBR2             EQU  H'0002'
DBR3             EQU  H'0003'
DBR4             EQU  H'0004'
DBR5             EQU  H'0005'

